HA_1C/Documents/ВнеплановыеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВнеплановыеРаботы</Name>
			<Comment>!</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастерская</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеМастерские</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегламентнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеВРСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееВРСТатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеВРПериод</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРПериод</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееВРПериод</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеВРСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееВРСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HA_1C/InformationRegisters/ЗарегистрированныеВР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЗарегистрированныеВР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентнаяРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

HA_1C/Enums/СтатусыВыполненияТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыВыполненияТО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пройдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПройдено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

HA_1C/Documents/ВнеплановыеРаботы/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтчетныеПоказатели() Экспорт
	
	ПланТО = ТаблицаВнеплановыхТО(ТекущаяДата());
	
	ВидыТекущихТО = Новый Массив;
	ВидыТекущихТО.Добавить(ИмяПрошлогоВР());
	ВидыТекущихТО.Добавить(ИмяТекущееВР());
	
	НевыполненныеТО = 0;
	Для каждого СтрокаТО Из ПланТО Цикл
		Для каждого ВидТО Из ВидыТекущихТО Цикл
			Если Не ЗначениеЗаполнено(СтрокаТО[ВидТО + "ПоФакту"]) 
				И СтрокаТО[ВидТО + "Статус"] = Перечисления.СтатусыВыполненияТО.НеПройдено
				И СтрокаТО[ВидТО + "Номер"] > 0 Тогда
				НевыполненныеТО = НевыполненныеТО + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Показатели = Новый Соответствие;
	Показатели.Вставить(НСтр("ru = 'Невыполненные ТО:'; en = 'Not passed services:'"), НевыполненныеТО);
	
	Возврат Показатели;
	
КонецФункции

Функция ПолучитьВидыВР() Экспорт
	
	ВидыТО = Новый Массив;
	ВидыТО.Добавить(ИмяПрошлогоВР());
	ВидыТО.Добавить(ИмяТекущееВР());
	ВидыТО.Добавить(ИмяСледующееВР());
	
	Возврат ВидыТО;
	
КонецФункции

Функция ИмяПрошлогоВР() Экспорт
	
	Возврат "ПрошлоеВР";
	
КонецФункции

Функция ИмяТекущееВР() Экспорт
	
	Возврат "ТекущееВР";
	
КонецФункции

Функция ИмяСледующееВР() Экспорт
	
	Возврат "СледующееВР";
	
КонецФункции

Функция ТаблицаВнеплановыхТО(ДатаАнализа, Автомобиль = Неопределено) Экспорт
	
	Проверки.СвойствоЗаполнено(ДатаАнализа);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗарегистрированныеВР.Автомобиль КАК Автомобиль,
	|	ЗарегистрированныеВР.РегламентнаяРабота КАК РегламентнаяРабота,
	|	МАКСИМУМ(ЗарегистрированныеВРПред.Период) КАК ПериодПред,
	|	ЗарегистрированныеВР.Период КАК Период,
	|	МИНИМУМ(ЗарегистрированныеВРСлед.Период) КАК ПериодСлед
	|ПОМЕСТИТЬ ПериодыРабот
	|ИЗ
	|	РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРСлед
	|		ПО ЗарегистрированныеВР.РегламентнаяРабота = ЗарегистрированныеВРСлед.РегламентнаяРабота
	|			И ЗарегистрированныеВР.Автомобиль = ЗарегистрированныеВРСлед.Автомобиль
	|			И ЗарегистрированныеВР.Период < ЗарегистрированныеВРСлед.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРПред
	|		ПО ЗарегистрированныеВР.Автомобиль = ЗарегистрированныеВРПред.Автомобиль
	|			И ЗарегистрированныеВР.РегламентнаяРабота = ЗарегистрированныеВРПред.РегламентнаяРабота
	|			И ЗарегистрированныеВР.Период > ЗарегистрированныеВРПред.Период
	|ГДЕ
	|	(ЗарегистрированныеВР.Автомобиль = &Автомобиль
	|			ИЛИ &Автомобиль = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарегистрированныеВР.Автомобиль,
	|	ЗарегистрированныеВР.РегламентнаяРабота,
	|	ЗарегистрированныеВР.Период,
	|	ЗарегистрированныеВРПред.РегламентнаяРабота,
	|	ЗарегистрированныеВРСлед.РегламентнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарегистрированныеВРСрезПоследних.Автомобиль КАК Автомобиль,
	|	ЗарегистрированныеВРСрезПоследних.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ПериодыРабот.ПериодПред КАК ПрошлоеВРПериод,
	|	ЗарегистрированныеВРСрезПоследних.Период КАК ТекущееВРПериод,
	|	ПериодыРабот.ПериодСлед КАК СледующееВРПериод,
	|	ЗарегистрированныеВРСрезПоследних.Сумма КАК ТекущееВРСумма
	|ПОМЕСТИТЬ ПоследниеВнеплановыеВР
	|ИЗ
	|	ПериодыРабот КАК ПериодыРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР.СрезПоследних(
	|				&ДатаАнализа,
	|				Автомобиль = &Автомобиль
	|					ИЛИ &Автомобиль = НЕОПРЕДЕЛЕНО) КАК ЗарегистрированныеВРСрезПоследних
	|		ПО (ЗарегистрированныеВРСрезПоследних.Период = ПериодыРабот.Период)
	|			И (ЗарегистрированныеВРСрезПоследних.Автомобиль = ПериодыРабот.Автомобиль)
	|			И (ЗарегистрированныеВРСрезПоследних.РегламентнаяРабота = ПериодыРабот.РегламентнаяРабота)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеВнеплановыеВР.Автомобиль КАК Автомобиль,
	|	ПоследниеВнеплановыеВР.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ПоследниеВнеплановыеВР.ПрошлоеВРПериод КАК ПрошлоеВРПериод,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.Пройдено) КАК ПрошлоеВРСтатус,
	|	ПоследниеВнеплановыеВР.ТекущееВРПериод КАК ТекущееВРПериод,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.Пройдено) КАК ТекущееВРСтатус,
	|	ПоследниеВнеплановыеВР.СледующееВРПериод КАК СледующееВРПериод,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.Пройдено) КАК СледующееВРСтатус,
	|	ЗарегистрированныеВРПред.Сумма КАК ПрошлоеВРСумма,
	|	ЗарегистрированныеВРСлед.Сумма КАК СледующееВРСумма,
	|	ПоследниеВнеплановыеВР.ТекущееВРСумма КАК ТекущееВРСумма
	|ИЗ
	|	ПоследниеВнеплановыеВР КАК ПоследниеВнеплановыеВР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРСлед
	|		ПО ПоследниеВнеплановыеВР.Автомобиль = ЗарегистрированныеВРСлед.Автомобиль
	|			И ПоследниеВнеплановыеВР.РегламентнаяРабота = ЗарегистрированныеВРСлед.РегламентнаяРабота
	|			И ПоследниеВнеплановыеВР.СледующееВРПериод = ЗарегистрированныеВРСлед.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРПред
	|		ПО ПоследниеВнеплановыеВР.Автомобиль = ЗарегистрированныеВРПред.Автомобиль
	|			И ПоследниеВнеплановыеВР.РегламентнаяРабота = ЗарегистрированныеВРПред.РегламентнаяРабота
	|			И ПоследниеВнеплановыеВР.ПрошлоеВРПериод = ЗарегистрированныеВРПред.Период");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
